KrzysztofPhotos/BeeNode-nRF52840-IoT/src/main.c
    // 4. Inicjalizacja Przycisku SW3 (Kalibracja)
    if (device_is_ready(btn_calib.port)) {
        gpio_pin_configure_dt(&btn_calib, GPIO_INPUT | GPIO_PULL_UP);
    } else {
        printk("WARN: Przycisk SW3 niedostepny!\n");
    }

    printk("Gotowe! SW1: Test (Wybudzenie), SW2: Tara, SW3: Kalibracja, LED0/LED1: status.\n");
    return 0;
}

/* ============================================================================
 * POMOCNICZA: UŚREDNIANIE (jak w Arduino)
 * ============================================================================ */
static int32_t hx711_read_average(int times) {
    int64_t sum = 0;
    for (int i = 0; i < times; i++) {
        sum += hx711_read();
        k_sleep(K_MSEC(10)); // Krotka przerwa miedzy odczytami
    }
    return (int32_t)(sum / times);
}

/* ============================================================================
 * DANE BLUETOOTH (Zmienne globalne dla GATT)
 * ============================================================================ */
uint16_t current_weight_ble = 0;       // Waga dla BLE (rozdzielczosc 0.005 kg)
uint8_t  current_battery_level = 88;   // Procent baterii (0-100%)
uint16_t current_battery_voltage = 395;// Napiecie baterii (395 = 3.95V)
int16_t  current_temperature = 2250;   // Temperatura (2250 = 22.50 °C)


/* ============================================================================
 * CZUJNIK TEMPERATURY DS18B20
 * ============================================================================ */
static const struct device *ds18b20_dev = DEVICE_DT_GET_ANY(maxim_ds18b20);

static int16_t read_real_temperature(void) {
    if (!device_is_ready(ds18b20_dev)) {
        printk("WARN: Czujnik DS18B20 nie jest podlaczony lub gotowy!\n");
        return 2250; // Wartosc awaryjna (22.50 st C) jesli czujnik odpadnie
    }

    struct sensor_value temp;
    if (sensor_sample_fetch(ds18b20_dev) == 0) {
        sensor_channel_get(ds18b20_dev, SENSOR_CHAN_AMBIENT_TEMP, &temp);
        double temp_c = sensor_value_to_double(&temp);
        int16_t temp_x100 = (int16_t)(temp_c * 100);
        // printk(">>> DS18B20: %.2f st. C (do BLE: %d) <<<\n", temp_c, temp_x100);
        return temp_x100;
    }
    
    printk("Blad odczytu DS18B20!\n");
    return 2250;
}


/* ============================================================================
 * BLUETOOTH - ADVERTISING (Nowy Standard)
 * ============================================================================ */
// Company ID (0xFFFE) | DeviceType (0xA1) | Sensor ID (4 Bajty)
static uint8_t mfg_data[7] = {0xFE, 0xFF, 0xA1, 0x00, 0x00, 0x00, 0x00};

static const struct bt_data ad[] = {
    BT_DATA_BYTES(BT_DATA_FLAGS, BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR),
    BT_DATA(BT_DATA_MANUFACTURER_DATA, mfg_data, sizeof(mfg_data)),
};

static const struct bt_data sd[] = {
    BT_DATA(BT_DATA_NAME_COMPLETE, "BeeNode", 7),
};

/* ============================================================================
 * BLUETOOTH - CALLBACKI ODCZYTU (GATT)
 * ============================================================================ */
// 1. ODCZYT WAGI (Flags 1B + Waga 2B)
static ssize_t read_weight(struct bt_conn *conn, const struct bt_gatt_attr *attr, void *buf, uint16_t len, uint16_t offset) {
    uint8_t payload[3];
    payload[0] = 0x00; // Flaga: Waga w kilogramach (SI)
    payload[1] = current_weight_ble & 0xFF;        // mlodszy bajt
    payload[2] = (current_weight_ble >> 8) & 0xFF; // starszy bajt
    return bt_gatt_attr_read(conn, attr, buf, len, offset, payload, sizeof(payload));
}

// 2. ODCZYT PROCENTÓW BATERII
static ssize_t read_bat_level(struct bt_conn *conn, const struct bt_gatt_attr *attr, void *buf, uint16_t len, uint16_t offset) {
    return bt_gatt_attr_read(conn, attr, buf, len, offset, &current_battery_level, sizeof(current_battery_level));
}

// 3. ODCZYT NAPIĘCIA BATERII
static ssize_t read_bat_voltage(struct bt_conn *conn, const struct bt_gatt_attr *attr, void *buf, uint16_t len, uint16_t offset) {
    return bt_gatt_attr_read(conn, attr, buf, len, offset, &current_battery_voltage, sizeof(current_battery_voltage));
}

// 4. ODCZYT TEMPERATURY
static ssize_t read_temperature(struct bt_conn *conn, const struct bt_gatt_attr *attr, void *buf, uint16_t len, uint16_t offset) {
    return bt_gatt_attr_read(conn, attr, buf, len, offset, &current_temperature, sizeof(current_temperature));
}

/* ============================================================================
 * BLUETOOTH - DEFINICJA STRUKTURY SERWISÓW (GATT TREE)
 * ============================================================================ */
// UUID dla Napięcia (Niestandardowe, z dokumentacji)
static struct bt_uuid_128 bat_volt_uuid = BT_UUID_INIT_128(
    BT_UUID_128_ENCODE(0x0000FFF2, 0x0000, 0x1000, 0x8000, 0x00805F9B34FB)
);

BT_GATT_SERVICE_DEFINE(beenode_svc,
    // --- SERWIS WAGI (Weight Scale: 0x181D) ---
    BT_GATT_PRIMARY_SERVICE(BT_UUID_DECLARE_16(0x181D)),
    BT_GATT_CHARACTERISTIC(BT_UUID_DECLARE_16(0x2A9D), BT_GATT_CHRC_READ, BT_GATT_PERM_READ, read_weight, NULL, NULL),

    // --- SERWIS BATERII (Battery Service: 0x180F) ---
    BT_GATT_PRIMARY_SERVICE(BT_UUID_BAS),
    BT_GATT_CHARACTERISTIC(BT_UUID_BAS_BATTERY_LEVEL, BT_GATT_CHRC_READ, BT_GATT_PERM_READ, read_bat_level, NULL, NULL),
    BT_GATT_CHARACTERISTIC(&bat_volt_uuid.uuid, BT_GATT_CHRC_READ, BT_GATT_PERM_READ, read_bat_voltage, NULL, NULL),

    // --- SERWIS TEMPERATURY (Environmental Sensing: 0x181A) ---
    BT_GATT_PRIMARY_SERVICE(BT_UUID_ESS),
    BT_GATT_CHARACTERISTIC(BT_UUID_DECLARE_16(0x2A6E), BT_GATT_CHRC_READ, BT_GATT_PERM_READ, read_temperature, NULL, NULL)
);

/* ============================================================================
 * AKTUALIZACJA DANYCH BLUETOOTH (Zastępuje stare update_sensor_frame)
 * ============================================================================ */
static void update_ble_data(void)
{
    // 1. Wpisz unikalne ID mikrokontrolera do paczki Advertisingu
    uint32_t dev_id = NRF_FICR->DEVICEID[0];
    mfg_data[3] = (dev_id >> 24) & 0xFF;
    mfg_data[4] = (dev_id >> 16) & 0xFF;
    mfg_data[5] = (dev_id >> 8)  & 0xFF;
    mfg_data[6] = dev_id & 0xFF;
    
    // 2. Przelicz aktualna wage na standard BLE
    int32_t raw_val = hx711_read();
    int32_t weight_no_tare = tare_offset - raw_val;
    if (weight_no_tare < 0 && weight_no_tare > -5000) weight_no_tare = 0; 
    
