KrzysztofPhotos/BeeNode-nRF52840-IoT/src/main.c
    double weight_kg = (double)weight_no_tare / calib_factor;
    
    // Zgodnie z wytycznymi: rozdzielczość 0.005 kg
    // Żeby uzyskać wartość dla BLE matematycznie: waga / 0.005 (czyli waga * 200)
    current_weight_ble = (uint16_t)(weight_kg * 200.0);

    // 3. Pobierz prawdziwa temperature z DS18B20 do GATT
    current_temperature = read_real_temperature();
    // -----------------
}

/* ============================================================================
 * BLUETOOTH - CONNECTION CALLBACKS
 * ============================================================================ */

static struct bt_conn *current_conn = NULL;

static void connected(struct bt_conn *conn, uint8_t err)
{
    if (err) {
        printk("BLE: Błąd połączenia: %u\n", err);
        return;
    }

    char addr[BT_ADDR_LE_STR_LEN];
    bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));
    printk("BLE: Połączono z %s\n", addr);
    
    current_conn = bt_conn_ref(conn);
}

static void disconnected(struct bt_conn *conn, uint8_t reason)
{
    char addr[BT_ADDR_LE_STR_LEN];
    bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));
    printk("BLE: Rozłączono z %s (powód: %u)\n", addr, reason);
    
    if (current_conn) {
        bt_conn_unref(current_conn);
        current_conn = NULL;
    }
}

BT_CONN_CB_DEFINE(conn_callbacks) = {
    .connected = connected,
    .disconnected = disconnected,
};

/* ============================================================================
 * BLUETOOTH - INICJALIZACJA
 * ============================================================================ */

static void bt_ready(int err)
{
    if (err) {
        printk("BLE: Błąd inicjalizacji: %d\n", err);
        return;
    }
    printk("BLE: Stack gotowy\n");
}

/* ============================================================================
 * ADVERTISING - ZARZĄDZANIE
 * ============================================================================ */

/**
 * Rozpoczyna advertising z szybkim interwałem
 * Umożliwia szybkie wykrycie przez RPi
 */
static int start_advertising(void)
{
    // DEBUGOWANIE: Sprawdź rozmiary
    // printk("DEBUG: sizeof(sensor_frame_t) = %u\n", sizeof(struct sensor_frame_t));
    // printk("DEBUG: sizeof(mfg_data) = %u\n", sizeof(mfg_data));
    // printk("DEBUG: Total AD payload = %u bytes\n", 
    //        3 + sizeof(mfg_data) + 2);  // FLAGS + MFG_DATA + overhead
    
    // Sprawdź czy BT jest gotowy
    if (!bt_is_ready()) {
        printk("ERROR: Bluetooth nie jest gotowy!\n");
        return -EAGAIN;
    }

    struct bt_le_adv_param adv_param = {
        .id = BT_ID_DEFAULT,
        .options = BT_LE_ADV_OPT_CONNECTABLE |
                   BT_LE_ADV_OPT_USE_TX_POWER,  // Usunięto USE_NAME
        .interval_min = BT_GAP_ADV_FAST_INT_MIN_2,  // 100 ms
        .interval_max = BT_GAP_ADV_FAST_INT_MAX_2,  // 150 ms
    };

    int err = bt_le_adv_start(&adv_param, ad, ARRAY_SIZE(ad), sd, ARRAY_SIZE(sd));
    if (err) {
        printk("ERROR: Błąd startu advertising: %d (", err);
        switch(err) {
            case -EINVAL: printk("EINVAL - nieprawidłowe parametry)\n"); break;
            case -EALREADY: printk("EALREADY - advertising już aktywny)\n"); break;
            case -ENOTSUP: printk("ENOTSUP - niewspierana operacja)\n"); break;
            case -ENOMEM: printk("ENOMEM - brak pamięci)\n"); break;
            case -EAGAIN: printk("EAGAIN - spróbuj ponownie)\n"); break;
            default: printk("Nieznany błąd)\n");
        }
        return err;
    }

    printk("BLE: Advertising rozpoczęty ✓\n");
    return 0;
}

/**
 * Zatrzymuje advertising
 */
static void stop_advertising(void)
{
    int err = bt_le_adv_stop();
    if (err) {
        printk("BLE: Błąd zatrzymania advertising: %d\n", err);
    } else {
        printk("BLE: Advertising zatrzymany\n");
    }
}

/* ============================================================================
 * DEEP SLEEP (SYSTEM OFF)
 * ============================================================================ */

/**
 * Przechodzi w tryb System OFF z wybudzeniem przez RTC
 * 
 * UWAGA: W trybie System OFF:
 * - Zatrzymane są wszystkie peryferia (BLE, UART, itp.)
 * - Pobór prądu ~0.4 µA
 * - Wybudzenie = reset systemu (program startuje od początku)
 * - Zachowana jest tylko pamięć RAM (jeśli skonfigurowana)
 * 
 * @param seconds Czas snu w sekundach
 */
static void enter_deep_sleep(uint32_t seconds)
{
    printk("System OFF na %u sekund\n", seconds);

    /* 1. Start LFCLK (RTC tego wymaga) */
    NRF_CLOCK->TASKS_LFCLKSTART = 1;
    while (!NRF_CLOCK->EVENTS_LFCLKSTARTED);
    NRF_CLOCK->EVENTS_LFCLKSTARTED = 0;

    /* 2. Konfiguracja RTC1 */
    NRF_RTC1->TASKS_STOP = 1;
    NRF_RTC1->TASKS_CLEAR = 1;
    NRF_RTC1->PRESCALER = 0; // 32768 Hz

    uint32_t ticks = seconds * 32768;
    if (ticks > 0x00FFFFFF) {
        ticks = 0x00FFFFFF;
    }

    NRF_RTC1->CC[0] = ticks;
    NRF_RTC1->EVENTS_COMPARE[0] = 0;
    NRF_RTC1->EVTENSET = RTC_EVTENSET_COMPARE0_Msk;
    NRF_RTC1->TASKS_START = 1;

    /* 3. Wake-up z przycisków */
    // P0.11 – BUTTON1 (TEST / SW1)
    NRF_GPIO->PIN_CNF[NRF_GPIO_PIN_MAP(0,11)] =
        (GPIO_PIN_CNF_SENSE_Low << GPIO_PIN_CNF_SENSE_Pos) |
        (GPIO_PIN_CNF_PULL_Pullup << GPIO_PIN_CNF_PULL_Pos) |
        (GPIO_PIN_CNF_INPUT_Connect << GPIO_PIN_CNF_INPUT_Pos) |
        (GPIO_PIN_CNF_DIR_Input << GPIO_PIN_CNF_DIR_Pos);

    // P0.12 – BUTTON2 (TARE / SW2)
    NRF_GPIO->PIN_CNF[NRF_GPIO_PIN_MAP(0,12)] =
        (GPIO_PIN_CNF_SENSE_Low << GPIO_PIN_CNF_SENSE_Pos) |
        (GPIO_PIN_CNF_PULL_Pullup << GPIO_PIN_CNF_PULL_Pos) |
        (GPIO_PIN_CNF_INPUT_Connect << GPIO_PIN_CNF_INPUT_Pos) |
        (GPIO_PIN_CNF_DIR_Input << GPIO_PIN_CNF_DIR_Pos);

    // P0.24 – BUTTON3 (CAL / SW3)
    NRF_GPIO->PIN_CNF[NRF_GPIO_PIN_MAP(0,24)] =
        (GPIO_PIN_CNF_SENSE_Low << GPIO_PIN_CNF_SENSE_Pos) |
        (GPIO_PIN_CNF_PULL_Pullup << GPIO_PIN_CNF_PULL_Pos) |
        (GPIO_PIN_CNF_INPUT_Connect << GPIO_PIN_CNF_INPUT_Pos) |
        (GPIO_PIN_CNF_DIR_Input << GPIO_PIN_CNF_DIR_Pos);

    printk("SYSTEM OFF\n");

