KrzysztofPhotos/BeeNode-nRF52840-IoT/src/main.c
    /* 4. System OFF */
    NRF_POWER->SYSTEMOFF = 1;

    while (1) {
        __WFE();
    }
}


/* ============================================================================
 * MAIN LOOP
 * ============================================================================ */

int main(void)
{
    printk("\n");
    printk("========================================\n");
    printk("  BeeNode - Beehive Monitor v1.0\n");
    printk("========================================\n");
    printk("Board: NRF52840 DK\n");
    printk("Build: %s %s\n", __DATE__, __TIME__);
    printk("========================================\n\n");

    // Inicjalizacja naszej wagi
    hx711_init();

    // Inicjalizacja interfejsu (LED + SW2)
    ui_setup();

    // --- Inicjalizacja i wczytanie pamieci ---
    settings_subsys_init();
    settings_register(&scale_conf);
    settings_load();
    printk("Zaladowano z pamieci NVS -> Tara: %d, Wspolczynnik: %.1f\n", tare_offset, calib_factor);
    // -----------------------------------------

    // Inicjalizacja Bluetooth
    int err = bt_enable(bt_ready);
    if (err) {
        printk("FATAL: Bluetooth enable failed: %d\n", err);
        return err;
    }
    k_sleep(K_MSEC(500));  // Daj czas na inicjalizację

    // --- TX POWER +4 dBm ---
    // Ustaw TX power radia na +4 dBm (nRF52840)
    NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos4dBm;
    printk("TX power ustawiony na +4 dBm (RADIO)\n");

    printk("\n=== GŁÓWNA PĘTLA PROGRAMU ===\n\n");

    // Odczytaj rejestr LATCH (zapisuje piny, ktore wybudzily z System OFF)
    uint32_t latch = NRF_P0->LATCH;
    NRF_P0->LATCH = 0xFFFFFFFF; // Wyczyść LATCH

    // Przycisk SW2 (Tara) to P0.12, Przycisk SW3 (Kalibracja) to P0.24
    // Sprawdzamy czy wybudzenie nastapilo z konkretnego pinu, lub czy jest on wciaz wcisniety
    bool is_tare = (latch & (1 << 12)) || (gpio_pin_get_dt(&btn_tare) == 1);
    bool is_cal = (latch & (1 << 24)) || (gpio_pin_get_dt(&btn_calib) == 1);

    if (is_tare) {
        printk(">>> TRYB: TARE (Zapis punktu zerowego)\n");
        printk("Pusto na wadze. Zrozumiałem, zapisałem nowe zero.\n");
        
        gpio_pin_set_dt(&led1, 1); // Zapal LED2 (Czerwona) na ~1 sekunde
        
        tare_offset = hx711_read_average(10); // Odczyt i usrednienie (zajmie chwile)
        settings_save_one("scale/tare", &tare_offset, sizeof(tare_offset));
        
        k_sleep(K_MSEC(1000)); // Upewnij sie, ze minela co najmniej sekunda
        gpio_pin_set_dt(&led1, 0); // Zgas LED2
        
    } else if (is_cal) {
        printk(">>> TRYB: CALIBRATION (Kalibracja odważnikiem)\n");
        
        // Faza 1: Pulsowanie (czas na reakcje)
        printk("Masz 10 sekund, żeby spokojnie położyć ciężar na szali...\n");
        set_led_mode(LED_BLINK_FAST);
        k_sleep(K_SECONDS(10));
        
        // Faza 2: Zapis (Swiatlo ciagle na 2 sekundy)
        set_led_mode(LED_OFF);
        gpio_pin_set_dt(&led0, 1);
        printk("Czytam wage...\n");
        
        int32_t reading = hx711_read_average(10);
        calib_factor = (float)(tare_offset - reading) / known_weight_kg;
        settings_save_one("scale/factor", &calib_factor, sizeof(calib_factor));
        
        printk(">>> Wspolczynnik wyliczony! (Wartosc: %.1f)\n", calib_factor);
        k_sleep(K_SECONDS(2));
        gpio_pin_set_dt(&led0, 0);
        
    } else {
        printk(">>> TRYB: TEST (Szybki pomiar)\n");
        printk("Obudziłem się, robię szybki pomiar i wracam do spania.\n");
        
        // Zapal zielona diode na 1 sekunde
        gpio_pin_set_dt(&led0, 1);
        k_sleep(K_SECONDS(1));
        gpio_pin_set_dt(&led0, 0);
        
        // Odczyt, puszcza sygnal BLE i spi
        update_ble_data();
        
        err = start_advertising();
        if (!err) {
            // Szybka wysylka przez 5 sekund
            uint64_t adv_start_time = k_uptime_get();
            while (k_uptime_get() - adv_start_time < 5000) {
                if (current_conn) {
                    k_sleep(K_SECONDS(2));
                    bt_conn_disconnect(current_conn, BT_HCI_ERR_REMOTE_USER_TERM_CONN);
                    break;
                }
                if ((k_uptime_get() - adv_start_time) % ADV_UPDATE_INTERVAL_MS == 0) {
                    update_ble_data();
                    bt_le_adv_update_data(ad, ARRAY_SIZE(ad), sd, ARRAY_SIZE(sd));
                }
                k_sleep(K_MSEC(100));
            }
            stop_advertising();
        }
    }

    // Powrot do spania
    enter_deep_sleep(DEEP_SLEEP_DURATION_S);

    return 0;
}

/**
 * ============================================================================
 * NOTATKI IMPLEMENTACYJNE
 * ============================================================================
 * 
 * TODO dla pełnej funkcjonalności:
 * 
 * 1. DEEP SLEEP:
 *    - Zamień __WFE() loop na sys_poweroff() gdy SDK to wspiera
 *    - Skonfiguruj retention RAM jeśli potrzebne
 *    - Dodaj GPIO wake-up jako backup (np. przycisk)
 * 
 * 2. POWER MANAGEMENT:
 *    - Włącz CONFIG_PM=y w prj.conf
 *    - Optymalizuj power consumption w stanie advertising
 *    - Zmierz rzeczywisty pobór prądu
 * 
 * 3. REAL-TIME CLOCK:
 *    - Dodaj obsługę RTC dla timestamp w date_hour
 *    - Synchronizacja czasu z RPi przy pierwszym połączeniu
 * 
 * 4. CZUJNIKI:
 *    - Zamień fake_*() na prawdziwe odczyty I2C/SPI
 *    - Dodaj error handling dla czujników
 *    - Kalibracja czujników
 * 
 * 5. GATT:
 *    - Dodaj więcej charakterystyk (konfiguracja, status, itp.)
 *    - Notifications dla real-time data streaming
 *    - Write characteristic dla konfiguracji zdalnej
 * 
 * 6. TESTOWANIE:
 *    - Test z nRF Connect (advertising + GATT)
 *    - Test z RPi Central (automatyczne połączenie)
 *    - Test power consumption
 *    - Test długoterminowy (stabilność)
 * 
 * ============================================================================
 */

 
